# Dataframe

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [1]:
food_info = pd.read_csv('food_info.csv')

In [6]:
titanic = sns.load_dataset("titanic")

In [89]:
# General method

#print(type(titanic))
#print(titanic.dtypes)
#food_info.head(3)
#food_info.tail(4)
#print(food_info.columns)
#print(food_info.shape)
#food_info.describe()
#food_info.info()
titanic.describe(include=['object', 'bool'])  #not numerical
titanic['who'].value_counts(normalize=True) #`value_counts()` 方法可以查看类别（类型为 object ）和布尔值（类型为 bool ）特征。

man      0.602694
woman    0.304153
child    0.093154
Name: who, dtype: float64

In [80]:
# locate

#food_info.loc[0]
#food_info[3:6]
#food_info.iloc[:,0]
#food_info['Ash_(g)']
#food_info[['Ash_(g)','Shrt_Desc']]
titanic.loc[0:5, 'sex':'parch']
#titanic.iloc[0:5, 0:3]
#titanic[:1] #首行
#titanic[-1:] #末行

      sex   age  sibsp  parch
0    male  22.0      1      0
1  female  38.0      1      0
2  female  26.0      0      0
3  female  35.0      1      0
4    male  35.0      0      0
5    male   NaN      0      0

In [29]:
# conditinal select features

col_names = food_info.columns.tolist()
#print(col_names)
gram_columns = []

for c in col_names:
        if c.endswith('(g)'):
            gram_columns.append(c)
gram_df = food_info[gram_columns]
gram_df.head()

,Water_(g),Protein_(g),Lipid_Tot_(g),Ash_(g),Carbohydrt_(g),Fiber_TD_(g),Sugar_Tot_(g),FA_Sat_(g),FA_Mono_(g),FA_Poly_(g)
0,15.87,0.85,81.11,2.11,0.06,0.0,0.06,51.368,21.021,3.043
1,15.87,0.85,81.11,2.11,0.06,0.0,0.06,50.489,23.426,3.012
2,0.24,0.28,99.48,0.00,0.00,0.0,0.00,61.924,28.732,3.694
3,42.41,21.40,28.74,5.11,2.34,0.0,0.50,18.669,7.778,0.800
4,41.11,23.24,29.68,3.18,2.79,0.0,0.51,18.764,8.598,0.784

In [31]:
# add new column 

iron_grams = food_info["Iron_(mg)"]/1000
food_info["iron_(g)"] = iron_grams
print(food_info.shape)

(8618, 37)

In [164]:
# 移除先前创捷的列

titanic['last'] = 1
titanic

titanic.drop(['last'], axis=1, inplace=True)
titanic

# hide row
titanic.drop([2]).head() # hide index==2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_labels
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,Adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,Adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,Adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,Adult
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,Unknown

In [36]:
# max min

food_info["Lipid_Tot_(g)"].max()

100.0

In [59]:
# sort

food_info.sort_values(by=["Sodium_(mg)","Water_(g)"], inplace=True, ascending=[False,True])
food_info[["Sodium_(mg)","Water_(g)"]]


# reset_index()

new_titanic_servical = titanic.sort_values('age')
new_titanic_servical.head()

#titanic_reindexed = new_titanic_servical.reset_index(drop=True)
#titanic_reindexed.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
78,1,2,male,0.83,0,2,29.0000,S,Second,child,False,NaN,Southampton,yes,False

In [33]:
# count NA

age_null = pd.isnull(titanic["age"])
titanic[age_null].shape # 177 missing on Age

(177, 15)

In [65]:
# dropna()

drop_na_columns = titanic.dropna(axis=1) # drop any columns containing NA
new_titanic = titanic.dropna(axis=0, subset=['age','sex'])

In [67]:
# NAs in each column

def not_null_count(object):
    column_null = pd.isnull(object)
    a = object[column_null]
    return len(a)

column_null_count = titanic.apply(not_null_count)
print(column_null_count)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [36]:
# average age

a = titanic[age_null == False]["age"]
sum(a)/len(a)


# mean()
titanic[age_null == False]["age"].mean()

29.69911764705882

In [1]:
# groupby

titanic.groupby(['pclass'])['fare'].describe(percentiles=[])
#titanic.groupby(['pclass'])['survived'].mean()

# groupby with aggregation

#titanic.groupby(['pclass'])['fare'].agg([np.mean, np.std, np.min, np.max])

NameError: name 'titanic' is not defined

In [64]:
# pivot_table

# index -- which column to group by
# values -- column to apply calculation
# aggunc -- what function

passenger_survival = titanic.pivot_table(index='pclass', values='survived', aggfunc=np.mean)
passenger_survival

#passenger_age = titanic.pivot_table(index='pclass', values='age', aggfunc=np.mean)
#passenger_age

#port_stats = titanic.pivot_table(index='embarked', values=['fare','survived'], aggfunc=np.sum)
#port_stats

        survived
pclass
1       0.629630
2       0.472826
3       0.242363

In [116]:
# apply()

def hundredth_row(column):
    # Extract the hundredth item
    hundredth_item = column.loc[99]
    return hundredth_item

a = titanic.apply(hundredth_row)
#print(a)

titanic.max()
#list = titanic.columns[]
list = titanic.columns[titanic.dtypes == 'int64']
titanic[list].apply(np.max)

survived    1
pclass      3
sibsp       8
parch       6
dtype: int64

In [133]:
# apply() & lambda
#titanic[titanic['embark_town'].apply(lambda embark_town: embark_town[0] == 'S')].head()
titanic[titanic['sex'].apply(lambda sex: sex[0] == 'm')].head() # only male

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_labels
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,Adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,Adult
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,Unknown
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,Adult
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,minor

In [136]:
# map

d = {'no': False, 'yes': True}
titanic['alive'] = titanic['alive'].map(d)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_labels
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False,Adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,True,False,Adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,True,Adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,True,False,Adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,Adult

In [138]:
# replace 

e = {False: 'no', True: 'yes'}
titanic = titanic.replace({'alive': e})
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_labels
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,Adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,Adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,Adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,Adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,Adult

In [72]:
# continuous to discrete

def is_minor(row):
    if row['age']<18:
        return True
    else:
        return False

minors = titanic.apply(is_minor, axis=1)
#print(minors)
    
def generate_age_label(row):
    age = row['age']
    if pd.isnull(age):
        return 'Unknown'
    elif age<18:
        return 'minor'
    else:    
        return 'Adult'

age_labels = titanic.apply(generate_age_label, axis=1)
print(age_labels)

titanic['age_labels'] = age_labels
age_group_survival = titanic.pivot_table(index='age_labels', values='survived')
print(age_group_survival)

0        Adult
1        Adult
2        Adult
3        Adult
4        Adult
5      Unknown
6        Adult
7        minor
8        Adult
9        minor
10       minor
11       Adult
12       Adult
13       Adult
14       minor
15       Adult
16       minor
17     Unknown
18       Adult
19     Unknown
20       Adult
21       Adult
22       minor
23       Adult
24       minor
25       Adult
26     Unknown
27       Adult
28     Unknown
29     Unknown
        ...
861      Adult
862      Adult
863    Unknown
864      Adult
865      Adult
866      Adult
867      Adult
868    Unknown
869      minor
870      Adult
871      Adult
872      Adult
873      Adult
874      Adult
875      minor
876      Adult
877      Adult
878    Unknown
879      Adult
880      Adult
881      Adult
882      Adult
883      Adult
884      Adult
885      Adult
886      Adult
887      Adult
888    Unknown
889      Adult
890      Adult
Length: 891, dtype: object
            survived
age_labels
Adult       0.381032
Unknown     0.293785
minor       0.539823

# Series

In [9]:
from pandas import Series

In [12]:
fandango = pd.read_csv('fandango_score_comparison.csv')
series_film = fandango['FILM']

series_rt = fandango['RottenTomatoes']

In [8]:
print(type(series_film))
#print(series_film[0:5])
#print(series_film.head())

<class 'pandas.core.series.Series'>

In [15]:
film_names = series_film.values
print(type(film_names))

rt_score = series_rt.values
series_custom = Series(rt_score, index=film_names)
#series_custom[ ['Minions (2015)', 'Laviathan (2014)'] ]
series_custom[5:10]

<class 'numpy.ndarray'>

The Water Diviner (2015)        63
Irrational Man (2015)           42
Top Five (2014)                 86
Shaun the Sheep Movie (2015)    99
Love & Mercy (2015)             89
dtype: int64

In [48]:
# edited version 

series_custom = Series(fandango['RottenTomatoes'].values,fandango['FILM'].values)
print(series_custom[5:10])

The Water Diviner (2015)        63
Irrational Man (2015)           42
Top Five (2014)                 86
Shaun the Sheep Movie (2015)    99
Love & Mercy (2015)             89
dtype: int64

In [39]:
# sort

#series_custom.sort_index()
#series_custom.sort_values()

Paul Blart: Mall Cop 2 (2015)                    5
Hitman: Agent 47 (2015)                          7
Hot Pursuit (2015)                               8
Fantastic Four (2015)                            9
Taken 3 (2015)                                   9
The Boy Next Door (2015)                        10
The Loft (2015)                                 11
Unfinished Business (2015)                      11
Mortdecai (2015)                                12
Seventh Son (2015)                              12
The Vatican Tapes (2015)                        13
Sinister 2 (2015)                               13
The Lazarus Effect (2015)                       14
Hot Tub Time Machine 2 (2015)                   14
The Gallows (2015)                              16
The Gunman (2015)                               17
Pixels (2015)                                   17
Strange Magic (2015)                            17
Do You Believe? (2015)                          18
Serena (2015)                                   18
Aloha (2015)                                    19
Self/less (2015)                                20
Little Boy (2015)                               20
The Woman In Black 2 Angel of Death (2015)      22
Fifty Shades of Grey (2015)                     25
Terminator Genisys (2015)                       26
Child 44 (2015)                                 26
Dark Places (2015)                              26
Jupiter Ascending (2015)                        26
Annie (2014)                                    27
                                              ...
Ex Machina (2015)                               92
Mission: Impossible â€“ Rogue Nation (2015)     92
Spy (2015)                                      93
The Gift (2015)                                 93
The Wrecking Crew (2015)                        93
Monkey Kingdom (2015)                           94
I'll See You In My Dreams (2015)                94
Tangerine (2015)                                95
The Diary of a Teenage Girl (2015)              95
Wild Tales (2014)                               96
It Follows (2015)                               96
Red Army (2015)                                 96
The Salt of the Earth (2015)                    96
What We Do in the Shadows (2015)                96
'71 (2015)                                      97
About Elly (2015)                               97
Two Days, One Night (2014)                      97
Amy (2015)                                      97
Mad Max: Fury Road (2015)                       97
Inside Out (2015)                               98
Paddington (2015)                               98
Mr. Turner (2014)                               98
Timbuktu (2015)                                 99
Shaun the Sheep Movie (2015)                    99
Leviathan (2014)                                99
Song of the Sea (2014)                          99
Phoenix (2015)                                  99
Selma (2014)                                    99
Seymour: An Introduction (2015)                100
Gett: The Trial of Viviane Amsalem (2015)      100
Length: 146, dtype: int64

In [47]:
# add

a = series_custom[5:10]
np.add(a,a)

The Water Diviner (2015)        126
Irrational Man (2015)            84
Top Five (2014)                 172
Shaun the Sheep Movie (2015)    198
Love & Mercy (2015)             178
dtype: int64

In [46]:
# average score from two medias

s1 = Series(fandango['RottenTomatoes'].values, index=fandango['FILM'])
s2 = Series(fandango['RottenTomatoes_User'].values, index=fandango['FILM'])
s_mean = (s1+s2)/2
print(s_mean[5:10])

FILM
The Water Diviner (2015)        62.5
Irrational Man (2015)           47.5
Top Five (2014)                 75.0
Shaun the Sheep Movie (2015)    90.5
Love & Mercy (2015)             88.0
dtype: float64

In [57]:
# datafrane set index

fandango_films = fandango.set_index('FILM', drop=False)
fandango_films[5:10]

,FILM,RottenTomatoes,RottenTomatoes_User,Metacritic,Metacritic_User,IMDB,Fandango_Stars,Fandango_Ratingvalue,RT_norm,RT_user_norm,...,IMDB_norm,RT_norm_round,RT_user_norm_round,Metacritic_norm_round,Metacritic_user_norm_round,IMDB_norm_round,Metacritic_user_vote_count,IMDB_user_vote_count,Fandango_votes,Fandango_Difference
FILM,,,,,,,,,,,,,,,,,,,,,
The Water Diviner (2015),The Water Diviner (2015),63,62,50,6.8,7.2,4.5,4.0,3.15,3.10,...,3.60,3.0,3.0,2.5,3.5,3.5,34,39373,397,0.5
Irrational Man (2015),Irrational Man (2015),42,53,53,7.6,6.9,4.0,3.5,2.10,2.65,...,3.45,2.0,2.5,2.5,4.0,3.5,17,2680,252,0.5
Top Five (2014),Top Five (2014),86,64,81,6.8,6.5,4.0,3.5,4.30,3.20,...,3.25,4.5,3.0,4.0,3.5,3.5,124,16876,3223,0.5
Shaun the Sheep Movie (2015),Shaun the Sheep Movie (2015),99,82,81,8.8,7.4,4.5,4.0,4.95,4.10,...,3.70,5.0,4.0,4.0,4.5,3.5,62,12227,896,0.5
Love & Mercy (2015),Love & Mercy (2015),89,87,80,8.5,7.8,4.5,4.0,4.45,4.35,...,3.90,4.5,4.5,4.0,4.5,4.0,54,5367,864,0.5